/* VMCOMPIL EXEC   Unzip compile for VM/CMS                           */
/*                 Author : George Petrov, 11 Apr 1995                */

signal on error

parms = '(long def(VM_CMS)'

/* Add local parms */
parms = parms 'TARGET(COMPAT) SOURCE'


say 'Compiling TREES C...'
'cc trees c 'parms
say 'Compiling CRYPT C...'
'cc crypt c 'parms
say 'Compiling TTYIO C...'
'cc ttyio c 'parms
say 'Compiling DEFLATE C...'
'cc deflate c 'parms
say 'Compiling FILEIO C...'
'cc fileio c 'parms
say 'Compiling GLOBALS C...'
'cc globals c 'parms
say 'Compiling ZIP C...'
'cc zip c 'parms
say 'Compiling UTIL C...'
'cc util c 'parms
say 'Compiling CRC32 C...'
'cc crc32 c 'parms
say 'Compiling ZIPFILE C...'
'cc zipfile c 'parms
say 'Compiling ZIPUP C...'
'cc zipup c 'parms
say 'Compiling CMSMVS C...'
'cc cmsmvs c 'parms
say 'Compiling CMS C...'
'cc cms c 'parms

say 'Linking all files...'
'cmod zip zip trees crypt deflate fileio globals ttyio',
           'util crc32 zipfile zipup cmsmvs cms'
say 'All Done!'
say "To run enter : ZIP parms"
exit rc

error:
say 'Error durring compilation!'
exit rc
